---
kind: other
id: Methods.T:Autodesk.Revit.DB.ParameterSetIterator
source: html/9505892c-95cc-cd04-0652-ea414b887198.htm
---
# ParameterSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.